cmsis-svd/cmsis-svd/data/Atmel/ATSAML22J17A.svd
        <register>
          <name>VREG</name>
          <description>VREG Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEL</name>
              <description>Voltage Regulator Selection in active mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>LDO selection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Buck selection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCVREG</name>
                  <description>Switched Cap selection</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STDBYPL0</name>
              <description>Standby in PL0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPEFF</name>
              <description>Low Power efficiency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSVSTEP</name>
              <description>Voltage Scaling Voltage Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSPER</name>
              <description>Voltage Scaling Period</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREF</name>
          <description>VREF Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSEN</name>
              <description>Temperature Sensor Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFOE</name>
              <description>Voltage Reference Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSEL</name>
              <description>Temperature Sensor Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Contrl</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEL</name>
              <description>Voltage Reference Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>1V0</name>
                  <description>1.0V voltage reference typical value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V1</name>
                  <description>1.1V voltage reference typical value</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V2</name>
                  <description>1.2V voltage reference typical value</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V25</name>
                  <description>1.25V voltage reference typical value</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V0</name>
                  <description>2.0V voltage reference typical value</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V2</name>
                  <description>2.2V voltage reference typical value</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V4</name>
                  <description>2.4V voltage reference typical value</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V5</name>
                  <description>2.5V voltage reference typical value</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BBPS</name>
          <description>Battery Backup Power Switch</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONF</name>
              <description>Battery Backup Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CONFSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>The backup domain is always supplied by main power</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APWS</name>
                  <description>The power switch is handled by the automatic power switch</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCED</name>
                  <description>The backup domain is always supplied by battery backup power</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD33</name>
                  <description>The power switch is handled by the BOD33</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEEN</name>
              <description>Wake Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSOKEN</name>
              <description>Power Supply OK Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKOUT</name>
          <description>Backup Output Control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLR</name>
              <description>Clear Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SET</name>
              <description>Set Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTCTGL</name>
              <description>RTC Toggle Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKIN</name>
          <description>Backup Input Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BKIN</name>
              <description>Backup Input Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
